// All this Data is according to King Fahd Complex for the Printing of the Holy Quran

const suar = [{
    suravalue: 1,
    suraname: "الفاتحة",
  },
  {
    suravalue: 2,
    suraname: "البقرة",
  },
  {
    suravalue: 3,
    suraname: "آل عمران",
  },
  {
    suravalue: 4,
    suraname: "النساء",
  },
  {
    suravalue: 5,
    suraname: "المائدة",
  },
  {
    suravalue: 6,
    suraname: "الأنعام",
  },
  {
    suravalue: 7,
    suraname: "الأعراف",
  },
  {
    suravalue: 8,
    suraname: "الأنفال",
  },
  {
    suravalue: 9,
    suraname: "التوبة",
  },
  {
    suravalue: 10,
    suraname: "يونس",
  },
  {
    suravalue: 11,
    suraname: "هود",
  },
  {
    suravalue: 12,
    suraname: "يوسف",
  },
  {
    suravalue: 13,
    suraname: "الرعد",
  },
  {
    suravalue: 14,
    suraname: "إبراهيم",
  },
  {
    suravalue: 15,
    suraname: "الحجر",
  },
  {
    suravalue: 16,
    suraname: "النحل",
  },
  {
    suravalue: 17,
    suraname: "الإسراء",
  },
  {
    suravalue: 18,
    suraname: "الكهف",
  },
  {
    suravalue: 19,
    suraname: "مريم",
  },
  {
    suravalue: 20,
    suraname: "طه",
  },
  {
    suravalue: 21,
    suraname: "الأنبياء",
  },
  {
    suravalue: 22,
    suraname: "الحج",
  },
  {
    suravalue: 23,
    suraname: "المؤمنون",
  },
  {
    suravalue: 24,
    suraname: "النور",
  },
  {
    suravalue: 25,
    suraname: "الفرقان",
  },
  {
    suravalue: 26,
    suraname: "الشعراء",
  },
  {
    suravalue: 27,
    suraname: "النمل",
  },
  {
    suravalue: 28,
    suraname: "القصص",
  },
  {
    suravalue: 29,
    suraname: "العنكبوت",
  },
  {
    suravalue: 30,
    suraname: "الروم",
  },
  {
    suravalue: 31,
    suraname: "لقمان",
  },
  {
    suravalue: 32,
    suraname: "السجدة",
  },
  {
    suravalue: 33,
    suraname: "الأحزاب",
  },
  {
    suravalue: 34,
    suraname: "سبأ",
  },
  {
    suravalue: 35,
    suraname: "فاطر",
  },
  {
    suravalue: 36,
    suraname: "يس",
  },
  {
    suravalue: 37,
    suraname: "الصافات",
  },
  {
    suravalue: 38,
    suraname: "ص",
  },
  {
    suravalue: 39,
    suraname: "الزمر",
  },
  {
    suravalue: 40,
    suraname: "غافر",
  },
  {
    suravalue: 41,
    suraname: "فصلت",
  },
  {
    suravalue: 42,
    suraname: "الشورى",
  },
  {
    suravalue: 43,
    suraname: "الزخرف",
  },
  {
    suravalue: 44,
    suraname: "الدخان",
  },
  {
    suravalue: 45,
    suraname: "الجاثية",
  },
  {
    suravalue: 46,
    suraname: "الأحقاف",
  },
  {
    suravalue: 47,
    suraname: "محمد",
  },
  {
    suravalue: 48,
    suraname: "الفتح",
  },
  {
    suravalue: 49,
    suraname: "الحجرات",
  },
  {
    suravalue: 50,
    suraname: "ق",
  },
  {
    suravalue: 51,
    suraname: "الذاريات",
  },
  {
    suravalue: 52,
    suraname: "الطور",
  },
  {
    suravalue: 53,
    suraname: "النجم",
  },
  {
    suravalue: 54,
    suraname: "القمر",
  },
  {
    suravalue: 55,
    suraname: "الرحمن",
  },
  {
    suravalue: 56,
    suraname: "الواقعة",
  },
  {
    suravalue: 57,
    suraname: "الحديد",
  },
  {
    suravalue: 58,
    suraname: "المجادلة",
  },
  {
    suravalue: 59,
    suraname: "الحشر",
  },
  {
    suravalue: 60,
    suraname: "الممتحنة",
  },
  {
    suravalue: 61,
    suraname: "الصف",
  },
  {
    suravalue: 62,
    suraname: "الجمعة",
  },
  {
    suravalue: 63,
    suraname: "المنافقون",
  },
  {
    suravalue: 64,
    suraname: "التغابن",
  },
  {
    suravalue: 65,
    suraname: "الطلاق",
  },
  {
    suravalue: 66,
    suraname: "التحريم",
  },
  {
    suravalue: 67,
    suraname: "الملك",
  },
  {
    suravalue: 68,
    suraname: "القلم",
  },
  {
    suravalue: 69,
    suraname: "الحاقة",
  },
  {
    suravalue: 70,
    suraname: "المعارج",
  },
  {
    suravalue: 71,
    suraname: "نوح",
  },
  {
    suravalue: 72,
    suraname: "الجن",
  },
  {
    suravalue: 73,
    suraname: "المزّمِّل",
  },
  {
    suravalue: 74,
    suraname: "المدّثر",
  },
  {
    suravalue: 75,
    suraname: "القيامة",
  },
  {
    suravalue: 76,
    suraname: "الإنسان",
  },
  {
    suravalue: 77,
    suraname: "المرسلات",
  },
  {
    suravalue: 78,
    suraname: "النبأ",
  },
  {
    suravalue: 79,
    suraname: "النازعات",
  },
  {
    suravalue: 80,
    suraname: "عبس",
  },
  {
    suravalue: 81,
    suraname: "التكوير",
  },
  {
    suravalue: 82,
    suraname: "الإنفطار",
  },
  {
    suravalue: 83,
    suraname: "المطففين",
  },
  {
    suravalue: 84,
    suraname: "الانشقاق",
  },
  {
    suravalue: 85,
    suraname: "البروج",
  },
  {
    suravalue: 86,
    suraname: "الطارق",
  },
  {
    suravalue: 87,
    suraname: "الأعلى",
  },
  {
    suravalue: 88,
    suraname: "الغاشية",
  },
  {
    suravalue: 89,
    suraname: "الفجر",
  },
  {
    suravalue: 90,
    suraname: "البلد",
  },
  {
    suravalue: 91,
    suraname: "الشمس",
  },
  {
    suravalue: 92,
    suraname: "الليل",
  },
  {
    suravalue: 93,
    suraname: "الضحى",
  },
  {
    suravalue: 94,
    suraname: "الشرح",
  },
  {
    suravalue: 95,
    suraname: "التين",
  },
  {
    suravalue: 96,
    suraname: "العلق",
  },
  {
    suravalue: 97,
    suraname: "القدر",
  },
  {
    suravalue: 98,
    suraname: "البينة",
  },
  {
    suravalue: 99,
    suraname: "الزلزلة",
  },
  {
    suravalue: 100,
    suraname: "العاديات",
  },
  {
    suravalue: 101,
    suraname: "القارعة",
  },
  {
    suravalue: 102,
    suraname: "التكاثر",
  },
  {
    suravalue: 103,
    suraname: "العصر",
  },
  {
    suravalue: 104,
    suraname: "الهُمَزَة",
  },
  {
    suravalue: 105,
    suraname: "الفيل",
  },
  {
    suravalue: 106,
    suraname: "قريش",
  },
  {
    suravalue: 107,
    suraname: "الماعون",
  },
  {
    suravalue: 108,
    suraname: "الكوثر",
  },
  {
    suravalue: 109,
    suraname: "الكافرون",
  },
  {
    suravalue: 110,
    suraname: "النصر",
  },
  {
    suravalue: 111,
    suraname: "المسد",
  },
  {
    suravalue: 112,
    suraname: "الإخلاص",
  },
  {
    suravalue: 113,
    suraname: "الفلق",
  },
  {
    suravalue: 114,
    suraname: "الناس",
  },
];
// suora (chapter) name in arabic and its order in the Holy Quran

const surapstart = [
  1, 2, 50, 77, 106, 128, 151, 177, 187, 208, 221, 235, 249, 255, 262, 267, 282,
  293, 305, 312, 322, 332, 342, 350, 359, 367, 377, 385, 396, 404, 411, 415,
  418, 428, 434, 440, 446, 453, 458, 467, 477, 483, 489, 496, 499, 502, 507,
  511, 515, 518, 520, 523, 526, 528, 531, 534, 537, 542, 545, 549, 551, 553,
  554, 556, 558, 560, 562, 564, 566, 568, 570, 572, 574, 575, 577, 578, 580,
  582, 583, 585, 586, 587, 587, 589, 590, 591, 591, 592, 593, 594, 595, 595,
  596, 596, 597, 597, 598, 598, 599, 599, 600, 600, 601, 601, 601, 602, 602,
  602, 603, 603, 603, 604, 604, 604,
];
// pages where every suora start

const agza = [{
    gozvalue: 1,
    gozname: "الأول",
  },
  {
    gozvalue: 2,
    gozname: "الثاني",
  },
  {
    gozvalue: 3,
    gozname: "الثالث",
  },
  {
    gozvalue: 4,
    gozname: "الرابع",
  },
  {
    gozvalue: 5,
    gozname: "الخامس",
  },
  {
    gozvalue: 6,
    gozname: "السادس",
  },
  {
    gozvalue: 7,
    gozname: "السابع",
  },
  {
    gozvalue: 8,
    gozname: "الثامن",
  },
  {
    gozvalue: 9,
    gozname: "التاسع",
  },
  {
    gozvalue: 10,
    gozname: "العاشر",
  },
  {
    gozvalue: 11,
    gozname: "الحادي عشر",
  },
  {
    gozvalue: 12,
    gozname: "الثاني عشر",
  },
  {
    gozvalue: 13,
    gozname: "الثالث عشر",
  },
  {
    gozvalue: 14,
    gozname: "الرابع عشر",
  },
  {
    gozvalue: 15,
    gozname: "الخامس عشر",
  },
  {
    gozvalue: 16,
    gozname: "السادس عشر",
  },
  {
    gozvalue: 17,
    gozname: "السابع عشر",
  },
  {
    gozvalue: 18,
    gozname: "الثامن عشر",
  },
  {
    gozvalue: 19,
    gozname: "التاسع عشر",
  },
  {
    gozvalue: 20,
    gozname: "العشرون",
  },
  {
    gozvalue: 21,
    gozname: "الحادي والعشرون",
  },
  {
    gozvalue: 22,
    gozname: "الثاني والعشرون",
  },
  {
    gozvalue: 23,
    gozname: "الثالث والعشرون",
  },
  {
    gozvalue: 24,
    gozname: "الرابع والعشرون",
  },
  {
    gozvalue: 25,
    gozname: "الخامس والعشرون",
  },
  {
    gozvalue: 26,
    gozname: "السادس والعشرون",
  },
  {
    gozvalue: 27,
    gozname: "السابع والعشرون",
  },
  {
    gozvalue: 28,
    gozname: "الثامن والعشرون",
  },
  {
    gozvalue: 29,
    gozname: "التاسع والعشرون",
  },
  {
    gozvalue: 30,
    gozname: "الثلاثون",
  },
];
// goz' name in arabic and its order in the Holy Quran

const agazastart = [
  1, 22, 42, 62, 82, 102, 122, 142, 162, 182, 202, 222, 242, 262, 282, 302, 322,
  342, 362, 382, 402, 422, 442, 462, 482, 502, 522, 542, 562, 582,
];
// pages where every goz' start


const aqsszzzpage = ["الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الأول", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثاني", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الثالث", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الرابع", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "الخامس", "السادس", "السادس", "السادس", "السادس", "السادس", "السادس", "السادس", "السادس", "السادس", "السادس", "السادس", "السادس", "السادس", "السادس", "السادس", "السادس", "السادس", "السادس", "السادس", "السادس", "السابع", "السابع", "السابع", "السابع", "السابع", "السابع", "السابع", "السابع", "السابع", "السابع", "السابع", "السابع", "السابع", "السابع", "السابع", "السابع", "السابع", "السابع", "السابع", "السابع", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "الثامن", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "التاسع", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "العاشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الحادي عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثاني عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الثالث عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الرابع عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "الخامس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السادس عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "السابع عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "الثامن عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "التاسع عشر", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "العشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الحادي والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثاني والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الثالث والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الرابع والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "الخامس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السادس والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "السابع والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "الثامن والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "التاسع والعشرون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون", "الثلاثون"]
const suuarperpage = ["الفاتحة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "البقرة", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "آل عمران", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "النساء", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "المائدة", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأنعام", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأعراف", "الأنفال", "الأنفال", "الأنفال", "الأنفال", "الأنفال", "الأنفال", "الأنفال", "الأنفال", "الأنفال", "الأنفال", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "التوبة", "يونس", "يونس", "يونس", "يونس", "يونس", "يونس", "يونس", "يونس", "يونس", "يونس", "يونس", "يونس", "يونس", "يونس", "هود", "هود", "هود", "هود", "هود", "هود", "هود", "هود", "هود", "هود", "هود", "هود", "هود", "هود", "يوسف", "يوسف", "يوسف", "يوسف", "يوسف", "يوسف", "يوسف", "يوسف", "يوسف", "يوسف", "يوسف", "يوسف", "يوسف", "يوسف", "الرعد", "الرعد", "الرعد", "الرعد", "الرعد", "الرعد", "إبراهيم", "إبراهيم", "إبراهيم", "إبراهيم", "إبراهيم", "إبراهيم", "إبراهيم", "الحجر", "الحجر", "الحجر", "الحجر", "الحجر", "النحل", "النحل", "النحل", "النحل", "النحل", "النحل", "النحل", "النحل", "النحل", "النحل", "النحل", "النحل", "النحل", "النحل", "النحل", "الإسراء", "الإسراء", "الإسراء", "الإسراء", "الإسراء", "الإسراء", "الإسراء", "الإسراء", "الإسراء", "الإسراء", "الإسراء", "الكهف", "الكهف", "الكهف", "الكهف", "الكهف", "الكهف", "الكهف", "الكهف", "الكهف", "الكهف", "الكهف", "الكهف", "مريم", "مريم", "مريم", "مريم", "مريم", "مريم", "مريم", "طه", "طه", "طه", "طه", "طه", "طه", "طه", "طه", "طه", "طه", "الأنبياء", "الأنبياء", "الأنبياء", "الأنبياء", "الأنبياء", "الأنبياء", "الأنبياء", "الأنبياء", "الأنبياء", "الأنبياء", "الحج", "الحج", "الحج", "الحج", "الحج", "الحج", "الحج", "الحج", "الحج", "الحج", "المؤمنون", "المؤمنون", "المؤمنون", "المؤمنون", "المؤمنون", "المؤمنون", "المؤمنون", "المؤمنون", "النور", "النور", "النور", "النور", "النور", "النور", "النور", "النور", "النور", "الفرقان", "الفرقان", "الفرقان", "الفرقان", "الفرقان", "الفرقان", "الفرقان", "الفرقان", "الشعراء", "الشعراء", "الشعراء", "الشعراء", "الشعراء", "الشعراء", "الشعراء", "الشعراء", "الشعراء", "الشعراء", "النمل", "النمل", "النمل", "النمل", "النمل", "النمل", "النمل", "النمل", "القصص", "القصص", "القصص", "القصص", "القصص", "القصص", "القصص", "القصص", "القصص", "القصص", "القصص", "العنكبوت", "العنكبوت", "العنكبوت", "العنكبوت", "العنكبوت", "العنكبوت", "العنكبوت", "العنكبوت", "الروم", "الروم", "الروم", "الروم", "الروم", "الروم", "الروم", "لقمان", "لقمان", "لقمان", "لقمان", "السجدة", "السجدة", "السجدة", "الأحزاب", "الأحزاب", "الأحزاب", "الأحزاب", "الأحزاب", "الأحزاب", "الأحزاب", "الأحزاب", "الأحزاب", "الأحزاب", "سبأ", "سبأ", "سبأ", "سبأ", "سبأ", "سبأ", "فاطر", "فاطر", "فاطر", "فاطر", "فاطر", "فاطر", "يس", "يس", "يس", "يس", "يس", "يس", "الصافات", "الصافات", "الصافات", "الصافات", "الصافات", "الصافات", "الصافات", "ص", "ص", "ص", "ص", "ص", "الزمر", "الزمر", "الزمر", "الزمر", "الزمر", "الزمر", "الزمر", "الزمر", "الزمر", "غافر", "غافر", "غافر", "غافر", "غافر", "غافر", "غافر", "غافر", "غافر", "غافر", "فصلت", "فصلت", "فصلت", "فصلت", "فصلت", "فصلت", "الشورى", "الشورى", "الشورى", "الشورى", "الشورى", "الشورى", "الزخرف", "الزخرف", "الزخرف", "الزخرف", "الزخرف", "الزخرف", "الزخرف", "الدخان", "الدخان", "الدخان", "الجاثية", "الجاثية", "الجاثية", "الأحقاف", "الأحقاف", "الأحقاف", "الأحقاف", "الأحقاف", "محمد", "محمد", "محمد", "محمد", "الفتح", "الفتح", "الفتح", "الفتح", "الحجرات", "الحجرات", "الحجرات", "ق", "ق", "الذاريات", "الذاريات", "الذاريات", "الطور", "الطور", "النجم", "النجم", "النجم", "النجم", "القمر", "القمر", "الرحمن", "الرحمن", "الرحمن", "الواقعة", "الواقعة", "الواقعة", "الحديد", "الحديد", "الحديد", "الحديد", "الحديد", "المجادلة", "المجادلة", "المجادلة", "الحشر", "الحشر", "الحشر", "الحشر", "الممتحنة", "الممتحنة", "الصف", "الصف", "الجمعة", "المنافقون", "المنافقون", "التغابن", "التغابن", "الطلاق", "الطلاق", "التحريم", "التحريم", "الملك", "الملك", "القلم", "القلم", "الحاقة", "الحاقة", "المعارج", "المعارج", "نوح", "نوح", "الجن", "الجن", "المزّمِّل", "المدّثر", "المدّثر", "القيامة", "الإنسان", "الإنسان", "المرسلات", "المرسلات", "النبأ", "النازعات", "النازعات", "عبس", "التكوير", "الإنفطار سورةالمطففين", "المطففين", "الانشقاق", "البروج", "الطارق سورةالأعلى", "الغاشية", "الفجر", "البلد", "الشمس سورةالليل", "الضحى سورةالشرح", "التين سورةالعلق", "القدر سورةالبينة", "الزلزلة سورةالعاديات", "القارعة سورةالتكاثر", "العصر سورةالهُمَزَة سورةالفيل", "قريش سورةالماعون سورةالكوثر", "الكافرون سورةالنصر سورةالمسد", "الإخلاص سورةالفلق سورةالناس"]
// this is array of 604 value which each indicates the name of the soura (chapter) and goz' for each page
//  modified for suorra ( when page is share two sura name )

// I hope this file help anyone try to program a software about The Holy Quran 
// I just ask you to check every Data in this file before use because The Holy Quran Is a big Responsibility on us to make sure of every thing we do about it
// good luck and pray for me , may allah grant Us jannah